                                                                                                               JehadAliTaj

#  <span style= "color:#0373fc>">  ANALYSIS OF TITANIC DATASET USING PANDAS </span>

##    <span style= "color:#0373fc>">  Introduction </span>

**The Titanic sank on April 15, 1912 during her maiden voyage. After colliding with an iceberg, 1502 of its 2224 passengers died. The data set investigated in the following sections contains detailed information about 891 passengers.**

##   <span style= "color:#0373fc>"> Feature description </span>

**The data set contains the following parameters for each individual passenger:**

* pclass: Passenger class (1 = 1st; 2 = 2nd; 3 = 3rd)
* survival: A Boolean indicating whether the passenger survived or not (0 = No; 1 = Yes); this is our target
* name: A field rich in information as it contains title and family names
* sex: male/female
* age: Age, asignificant portion of values aremissing
* sibsp: Number of siblings/spouses aboard
* parch: Number of parents/children aboard
* ticket: Ticket number.
* fare: Passenger fare (British Pound).
* cabin: Doesthe location of the cabin influence chances of survival?
* embarked: Port of embarkation (C = Cherbourg; Q = Queenstown; S = Southampton)
* boat: Lifeboat, many missing values
* body: Body Identification Number
* home.dest: Home/destination

###   <span style= "color:#0373fc>">Let's start with importing Pandas </span>

In [48]:
import pandas as pd

###   <span style= "color:#0373fc>"> Importing the dataset with read_csv   </span>

In [49]:
df= pd.read_csv("train.csv")
df

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

###  <span style= "color:#0373fc>">  Getting some information about dataset   </span>

In [50]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

#### Summary of Numerical data

In [7]:
df.describe()

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
count,891.000000,891.000000,891.000000,714.000000,891.000000,891.000000,891.000000
mean,446.000000,0.383838,2.308642,29.699118,0.523008,0.381594,32.204208
std,257.353842,0.486592,0.836071,14.526497,1.102743,0.806057,49.693429
min,1.000000,0.000000,1.000000,0.420000,0.000000,0.000000,0.000000
25%,223.500000,0.000000,2.000000,20.125000,0.000000,0.000000,7.910400
50%,446.000000,0.000000,3.000000,28.000000,0.000000,0.000000,14.454200
75%,668.500000,1.000000,3.000000,38.000000,1.000000,0.000000,31.000000
max,891.000000,1.000000,3.000000,80.000000,8.000000,6.000000,512.329200

#### Summary about catagorical data

In [8]:
print(df.describe(include=['O']))

                         Name   Sex    Ticket    Cabin Embarked
count                     891   891       891      204      889
unique                    891     2       681      147        3
top     Rood, Mr. Hugh Roscoe  male  CA. 2343  B96 B98        S
freq                        1   577         7        4      644

###  <span style= "color:#0373fc>">  Finding the null values   </span>

In [9]:
df.isnull().sum()

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
dtype: int64

###    <span style= "color:#0373fc>">   Dropping Columns</span>

* The Dataset contains information that will not be usefull for analysis. i-e "PassengerId", "Ticket"
* "Cabin" column contains so many "NaN" values, Therefore, drop this as well.

In [10]:
df.drop(['PassengerId', 'Ticket','Cabin'], axis=1,  inplace= True)

print(df.columns.values)

['Survived' 'Pclass' 'Name' 'Sex' 'Age' 'SibSp' 'Parch' 'Fare' 'Embarked']

In [12]:
df.isnull().sum()

Survived      0
Pclass        0
Name          0
Sex           0
Age         177
SibSp         0
Parch         0
Fare          0
Embarked      2
dtype: int64

###   <span style= "color:#0373fc>"> Data Cleaning  </span>

* To get rid of the the floating point numbers, all values are rounded up to the closest integer
* ceil() function from the Numpy module is used.

In [13]:
import numpy as np

In [14]:
df["Age"]= np.ceil(df["Age"])

In [15]:
df["Age"]

0      22.0
1      38.0
2      26.0
3      35.0
4      35.0
       ...
886    27.0
887    19.0
888     NaN
889    26.0
890    32.0
Name: Age, Length: 891, dtype: float64

#### Filling missing values

In [16]:
#Checking missing values
df.isnull()

     Survived  Pclass   Name    Sex    Age  SibSp  Parch   Fare  Embarked
0       False   False  False  False  False  False  False  False     False
1       False   False  False  False  False  False  False  False     False
2       False   False  False  False  False  False  False  False     False
3       False   False  False  False  False  False  False  False     False
4       False   False  False  False  False  False  False  False     False
..        ...     ...    ...    ...    ...    ...    ...    ...       ...
886     False   False  False  False  False  False  False  False     False
887     False   False  False  False  False  False  False  False     False
888     False   False  False  False   True  False  False  False     False
889     False   False  False  False  False  False  False  False     False
890     False   False  False  False  False  False  False  False     False

[891 rows x 9 columns]

In [17]:
age_mean = df['Age'].mean()

In [18]:
df.fillna(df.mean(), inplace = True)

In [19]:
df.isnull().sum()

Survived    0
Pclass      0
Name        0
Sex         0
Age         0
SibSp       0
Parch       0
Fare        0
Embarked    2
dtype: int64

In [20]:
# check if all values have been replaced
print("Remaining NaN values: {}".format(df['Age'].isnull().sum()))

Remaining NaN values: 0

In [21]:
df.fillna(df.mean(), inplace = True)

In [22]:
df.isnull().sum()

Survived    0
Pclass      0
Name        0
Sex         0
Age         0
SibSp       0
Parch       0
Fare        0
Embarked    2
dtype: int64

**The embarked column misses only 2 values. To replace these, we use the most common port which is by far (about 72 %) Southampton.**

In [23]:
# replace NaN values with S
df['Embarked'] = df['Embarked'].fillna('S')

In [24]:
df.isnull().sum()

Survived    0
Pclass      0
Name        0
Sex         0
Age         0
SibSp       0
Parch       0
Fare        0
Embarked    0
dtype: int64

###  <span style= "color:#0373fc>">  Columns Selection </span>

In [25]:
survived = df.Survived
sex = df.Sex
classs = df.Pclass
sibsp = df.SibSp
age = df.Age
lisst = list(zip(survived,sex,classs,sibsp,age))
columns = ['Survived', 'Sex', 'Pclass', 'SibSp', 'Age']
df_list= pd.DataFrame(lisst, columns= columns)
df_list.isnull().sum()
df_list.fillna(df_list.mean(), inplace = True)

In [26]:
df_list

     Survived     Sex  Pclass  SibSp        Age
0           0    male       3      1  22.000000
1           1  female       1      1  38.000000
2           1  female       3      0  26.000000
3           1  female       1      1  35.000000
4           0    male       3      0  35.000000
..        ...     ...     ...    ...        ...
886         0    male       2      0  27.000000
887         1  female       1      0  19.000000
888         0  female       3      1  29.714286
889         1    male       1      0  26.000000
890         0    male       3      0  32.000000

[891 rows x 5 columns]

In [27]:
df.isnull().sum()

Survived    0
Pclass      0
Name        0
Sex         0
Age         0
SibSp       0
Parch       0
Fare        0
Embarked    0
dtype: int64

#  <span style= "color:#0373fc>"> Problems Statements: </span>

### 1) How many passengers survived and how many were killed (in number and %)

In [28]:
# Sex
sex_survival = df[['Sex', 'Survived']].groupby('Sex', as_index=False).mean()
sex_survival

      Sex  Survived
0  female  0.742038
1    male  0.188908

In [29]:
total_survived= df.Survived.sum()
print (f"Total Survived:  {total_survived}")

Total Survived:  342

In [30]:
total_khalaq=891
total_survived=342
in_percent=342/891*100
in_percent

38.38383838383838

In [31]:
survived_male=(df_list['Survived']==1) & (df_list.Sex=='male')
s_male=survived_male.sum()
dead_male=(df_list['Survived']==0) & (df_list.Sex=='male')
d_male= dead_male.sum()

print(f" Survived male: ", s_male)
print(f" Dead male: ", d_male)

print("*" *50)

survived_female=(df_list['Survived']==1) & (df_list.Sex=='female')
s_female = survived_female.sum()
dead_female=(df_list['Survived']==0) & (df_list.Sex=='female')
d_female = dead_female.sum()

print(f" Survived Female : ", s_female)
print(f" Dead Female: ", d_female)

print("*" *50)

total_survived2=s_male+s_female
total_died2=d_male+ d_female

print(f"Total Survived: {total_survived2}")
print(f"Total Died: {total_died2}")

 Survived male:  109
 Dead male:  468
**************************************************
 Survived Female :  233
 Dead Female:  81
**************************************************
Total Survived: 342
Total Died: 549

## Total Survived and killed Passengers :

In [38]:
# Making DataFrame of the above data
data= { "Passenger": ["Male", "Female"], "Total Survived":[s_male,s_female ], "Total Deaths": [d_male,d_female ]}
index= [1,2]
dff22=pd.DataFrame(data,index)
dff22

  Passenger  Total Survived  Total Deaths
1      Male             109           468
2    Female             233            81

## Passengers survived and how many were killed in Percentage %

In [33]:
#Finding the percentage of survived and dead passengers


perc1=s_male /total_survived*100
perc1
p1= np.ceil(perc1)
print(f"Total Survived Male: {p1} %" )

perc2=d_male /total_khalaq*100
perc2
p2= np.ceil(perc2)
print(f"Total Dead Male: {p2} %" )


perc3=s_female /total_survived*100
perc3
p3= np.ceil(perc3)
print(f"Total Survived female: {p3} %" )
perc4=d_female /total_khalaq*100
perc4
p4= np.ceil(perc4)
print(f"Total Dead female: {p4} %" )

Total Survived Male: 32.0 %
Total Dead Male: 53.0 %
Total Survived female: 69.0 %
Total Dead female: 10.0 %

#### DataFrame:

In [89]:
data= { "Passenger": ["Survived Male", "Dead Male","Survived Female", "Dead Female" ], "Total Survived": [s_male,d_male,s_female,d_female], "Percentage %": [p1,p2,p3,p4]}
index= [1,2,3,4]
dff22=pd.DataFrame(data,index)
dff22

         Passenger  Total Survived  Percentage %
1    Survived Male             109          32.0
2        Dead Male             468          53.0
3  Survived Female             233          69.0
4      Dead Female              81          10.0

## 2) does survival had anything to do with the gender? (Survival vs Gender)

In [65]:
data= { "Passenger": ["Survived Male", "Dead Male","Survived Female", "Dead Female" ], "Total Survived": [s_male,d_male,s_female,d_female], "Percentage %": [p1,p2,p3,p4]}
index= [1,2,3,4]
dff22=pd.DataFrame(data,index)
dff22

         Passenger  Total Survived  Percentage %
1    Survived Male             109          32.0
2        Dead Male             468          53.0
3  Survived Female             233          69.0
4      Dead Female              81          10.0

#### Yes, from the above analysis it can be concluded that Survival rate of female are greater than male

### Final Comparison for Survival rate and Death rate:

#### The survival rate of female is high as compared to male passengers

# 3) Does survival have anything to do with the class in which the passenger was traveling and who survived more 1st class passengers, 2nd class passengers or 3rd class passengers?

# Pclass

In [77]:
survival_in_Class1 = (df_list['Survived']==1) & (df_list['Pclass']==1)
sc1 = survival_in_Class1.sum()
print(f"Survival in class 1: {sc1}"  )
dead_in_Class1 = (df_list['Survived']==0) & (df_list['Pclass']==1)
dc1= dead_in_Class1.sum()
print(f"Death in class 1:  {dc1}" )

print("*" *50)

survival_in_Class2=(df_list['Survived']==1) & (df_list['Pclass']==2)
sc2 = survival_in_Class2.sum()
print(f"Survival in class 2: {sc2}" )
dead_in_Class2=(df_list['Survived']==0) & (df_list['Pclass']==2)
dc2 = dead_in_Class2.sum()
print(f"Death in class 2: {dc2}" )

print("*" *50)

survival_in_Class3=(df_list['Survived']==1) & (df_list['Pclass']==3)
sc3 = survival_in_Class3.sum()
print( f"Survival in class 3: {sc3} " )

dead_in_Class3=(df_list['Survived']==0) & (df_list['Pclass']==3)
dc3 = dead_in_Class3.sum()
print (f"Death in class 2:  {dc3}" )

Survival in class 1: 136
Death in class 1:  80
**************************************************
Survival in class 2: 87
Death in class 2: 97
**************************************************
Survival in class 3: 119
Death in class 2:  372

## Pclass 1 Passengers survived the most

In [78]:
data2= { "Pclass": ["Class 1","Class 2",  "class 3" ], "Survived":[sc1, sc2, sc3], "Dead": [dc1,dc2,dc3 ]}
index= [1,2,3]
dff222=pd.DataFrame(data2,index)
dff222

    Pclass  Survived  Dead
1  Class 1       136    80
2  Class 2        87    97
3  class 3       119   372

## 4) Which age group, survived the most, kids (0-12), teen agers (13-19), youngsters (20-30), middle age people (31-50) or elders (50 and) greater) ?

### From  below analysis it is clear that the survival rate of youngsters are high

In [81]:
kid_m1 = (df.Survived == 1)  & (df.Sex == "male") & (df.Age <12)
kid_f1 = (df.Survived == 1)   & (df.Sex == "female") & (df.Age <12)
km1= kid_m1.sum()
kf2 = kid_f1.sum()
kids = km1 + kf2

print(f"Total kids survived :  {kids}" )

print("*" *50)
teen_m2 = (df.Survived == 1) &  (df.Sex == "male") & (df.Age < 19) & (df.Age > 13)
teen_f2= (df.Survived == 1) &  (df.Sex == "female") & (df.Age < 19) & (df.Age > 13)
tm2= teen_m2.sum()
tf2 = teen_f2.sum()
teen_agers = tm2 + tf2
 
print(f"Total Teen agers survived : {teen_agers} ")

print("*" *50)

young_m3 = (df.Survived == 1) &   (df.Sex == "male")& (df.Age < 30) & (df.Age > 20)
young_f3 = (df.Survived == 1)  & (df.Sex == "female")& (df.Age <30) & (df.Age > 20)
ym = young_m3.sum()
yf = young_f3.sum()
youngsters = ym + yf
 
print(f"Total Survived Youngsters are:  {youngsters}")

print("*" *50)

mid_m4 = (df.Survived == 1) &   (df.Sex == "male")& (df.Age < 50) & (df.Age > 31)
mid_f4 = (df.Survived == 1)  & (df.Sex == "female")& (df.Age <50) & (df.Age > 31)
mm4 = mid_m4.sum()
mf4 = mid_f4.sum()
mid_age = mm4 + mf4
 
print(f"Total Survived Middle age people are:  {mid_age}")

print("*" *50)

eld_m5 = (df.Survived == 1) &   (df.Sex == "male")&  (df.Age > 50)
eld_f5 = (df.Survived == 1)  & (df.Sex == "female")&  (df.Age > 50)
em5 = eld_m5.sum()
ef5 = eld_f5.sum()
elder_age = em5 + ef5
 
print(f"Total Survived elder age people are:  {elder_age}")

print("*" *50)

Total kids survived :  39
**************************************************
Total Teen agers survived : 28
**************************************************
Total Survived Youngsters are:  74
**************************************************
Total Survived Middle age people are:  89
**************************************************
Total Survived elder age people are:  22
**************************************************

In [82]:
data44= { "AgeGroup": ["kids" , "Teen agers", " Youngsters", "Middle Age", "Elders"], "Survival rate": [ kids, teen_agers, youngsters,mid_age, elder_age]}
index= [1,2,3,4,5]

dff44= pd.DataFrame(data44,index)
dff44

      AgeGroup  Survival rate
1         kids             39
2   Teen agers             28
3   Youngsters             74
4   Middle Age             89
5       Elders             22

 ### The results from the age group analysis show little Youngsters (20-30 years) had the highest chance of survival from all the groups. The lowest survival rate were observed for elder passengers

## 5) Which people survived the most, either those who were traveling with the family or those who were traveling alone?

In [85]:
# calculate the survival rates for the different family sizes
fam_survival = df[['SibSp', 'Survived']].groupby('SibSp').mean()

fam_survival

       Survived
SibSp
0      0.345395
1      0.535885
2      0.464286
3      0.250000
4      0.166667
5      0.000000
8      0.000000

### It seems like family size also influenced survival rates. Survival rates increase up to family sizes of 4 people and then fall significantly for larger families.

## 6) Finally compare the survival rate vs gender, class, age group, and family

In [91]:
#Survival Rate Vs Gender
dff22

         Passenger  Total Survived  Percentage %
1    Survived Male             109          32.0
2        Dead Male             468          53.0
3  Survived Female             233          69.0
4      Dead Female              81          10.0

In [79]:
# Survival Rate Vs Class
dff222

    Pclass  Survived  Dead
1  Class 1       136    80
2  Class 2        87    97
3  class 3       119   372

In [83]:
# Survival Rate Vs Age group
dff44

      AgeGroup  Survival rate
1         kids             39
2   Teen agers             28
3   Youngsters             74
4   Middle Age             89
5       Elders             22

In [86]:
#Survival rate vs Family
fam_survival

       Survived
SibSp
0      0.345395
1      0.535885
2      0.464286
3      0.250000
4      0.166667
5      0.000000
8      0.000000

# <span style= "color:#0373fc>"> Conclusions </span>

In [51]:
data66= { "Survival Rate": ["High", "Low" ], "Gender": ["Female", "Male"], "Pclass": ["Class 1", "Class 2"], " Age Group": ["Younsters", " Elders"], "Family":[4, "More Than 4"]}
index= [1,2]
dff66=pd.DataFrame(data66,index)
dff66

  Survival Rate  Gender   Pclass  Age Group       Family
1          High  Female  Class 1  Younsters            4
2           Low    Male  Class 2     Elders  More Than 4

####  From my analysis of Titanic dataset I conclude that, women had higher chances of survival.
#### The Class (Socio-Econominc status) of the passengers had played a vital role in their survival.
####  From age group, youngsterst (20-30) survived more than other age groups and the lowest - elders( > 50)
#### Survival rates increase up to family sizes of 4 people and then fall significantly for larger families.